# LAB 03 - Data Processing 1

## #01. 데이터 구조 점검 (1)

### 데이터 전처리 (Data Preprocessing / Handling)

In [ ]:
# 정의: 통계 분석이 가능한 상태로 데이터를 정제 및 구조화 하는 작업

# 목적: 분석 및 피처 엔지니어링 단계에서 바로 활용 가능한 
# 일관된 구조의 고품질 데이터셋을 얻는 것.

# 데이터분석 프로세스: 
# 1. 수집 -> 2. 전처리 -> 3. 피쳐 엔지니어링(머신러닝 성격) 
# -> 4. 탐색적 데이터 분석 -> 5. 확증적 데이터 분석 
# -> 6. 데이터 모델링(머신러닝)

#-----------------<강사님 설명>---------------------
# 빅분기 실기 내용은 오늘, 내일 수업에서 거의 나올거임

# 자기만의 데이터 전처리 과정을 정리해놓는거 좋음
#---------------------------------------------------

### #01. 준비작업

In [ ]:
#-----------------<강사님 설명>---------------------
# 명목형 타임: 연산 불가능한 데이터 타입들 ex) 남녀, 학년

# 앞으로의 변수 = column 임 조심!
#---------------------------------------------------

# 1. 패키지 참조:
from hossam import load_data         # 데이터 로딩함수
from pandas import CategoricalDtype  # 명목형 타입 클래스

In [ ]:
# 2. 데이터 가져오기:
origin = load_data("grade")
origin

[data] https://data.hossam.kr/data/common/grade.xlsx
[desc] 어느 학급의 과목별 점수를 조사한 가상의 데이터

field    description
-------  -------------
이름     index
학년     int
성별     str
국어     int
영어     int
수학     int
과학     int

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

### #02. 데이터 확인하기

In [3]:
# 데이터 크기:
rows, cols = origin.shape
print("%d행, %d열의 %d차원 데이터" % (rows, cols, origin.ndim))

9행, 6열의 2차원 데이터

In [4]:
# 각 변수의 데이터 타입 확인:
origin.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 철수 to 석영
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학년      9 non-null      int64
 1   성별      9 non-null      object
 2   국어      9 non-null      int64
 3   영어      9 non-null      int64
 4   수학      9 non-null      int64
 5   과학      9 non-null      int64
dtypes: int64(5), object(1)
memory usage: 504.0+ bytes

### #03. 데이터 타입 변경

In [ ]:
#-----------------<강사님 설명>---------------------
# 무조건 뭐 하나 분석할 때 마다 데이터프레임 '복사'해 놓고 시작하기!
# 팁: 변수 이름에 데이터프레임의 '생성 목적(용도)'을 '한글'로 적기

# (앞으로) 분석의 최소 단위: 데이터프레임

# 명목형 변수 지정: .astype('category') 
# -> 기초통계함수 쓸 때 명목형 변수는 계산에서 다 빠짐!
# -> (p.13) 명목형 변수들은 '서열척도'로 비교가능
#---------------------------------------------------

In [6]:
# 1. 컬럼 단위 변경
    # 1) 작업을 위한 복사본 생성:
컬럼타입변경df = origin.copy()
컬럼타입변경df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 철수 to 석영
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학년      9 non-null      int64
 1   성별      9 non-null      object
 2   국어      9 non-null      int64
 3   영어      9 non-null      int64
 4   수학      9 non-null      int64
 5   과학      9 non-null      int64
dtypes: int64(5), object(1)
memory usage: 504.0+ bytes

In [7]:
# 1. 컬럼 단위 변경
    # 2) 컬럼 단위의 데이터 타입 변경:
    # -> 하나의 컬럼은 시리즈 객체 -> .astype() 함수로 타입 변경 가능
    # -> 변경된 타입은 복사본 컬럼에 저장해야 복사본의 데이터프레임에 반영됨
컬럼타입변경df['국어'] = 컬럼타입변경df['국어'].astype('float')
컬럼타입변경df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 철수 to 석영
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학년      9 non-null      int64
 1   성별      9 non-null      object
 2   국어      9 non-null      float64
 3   영어      9 non-null      int64
 4   수학      9 non-null      int64
 5   과학      9 non-null      int64
dtypes: float64(1), int64(4), object(1)
memory usage: 804.0+ bytes

In [9]:
# 2. 타입 일괄 변경 후 새로운 DataFrame 리턴받기
    # 1) 타입 변환 적용:
    # -> 타입 변환을 수행할 변수만 '이름:타입' 형식의 딕셔너리로 구성함.
    # -> 결과가 적용된 복사본이 리턴됨
타입변환df = origin.astype(
    {
        '국어':'float',
        '영어':'float',
        '수학':'str',
        '과학':'bool'
    }
)
타입변환df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 철수 to 석영
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학년      9 non-null      int64
 1   성별      9 non-null      object
 2   국어      9 non-null      float64
 3   영어      9 non-null      float64
 4   수학      9 non-null      object
 5   과학      9 non-null      bool
dtypes: bool(1), float64(2), int64(1), object(2)
memory usage: 741.0+ bytes

In [10]:
# 2. 타입 일괄 변경 후 새로운 DataFrame 리턴받기
    # 2) 원본 확인:
    # DataFrame 객체에 대한 .astype() 함수는 결과가 적용된 복사본을 리턴함
    # 원본은 안변함
origin.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 철수 to 석영
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학년      9 non-null      int64
 1   성별      9 non-null      object
 2   국어      9 non-null      int64
 3   영어      9 non-null      int64
 4   수학      9 non-null      int64
 5   과학      9 non-null      int64
dtypes: int64(5), object(1)
memory usage: 804.0+ bytes

In [ ]:
# 3. 범주형 데이터를 '명목척도'로 변환
    # 방법 1) 컬럼 단위 변환하기:
컬럼단위_명목df = origin.copy()
컬럼단위_명목df['학년'] = 컬럼단위_명목df['학년'].astype('category')
컬럼단위_명목df['성별'] = 컬럼단위_명목df['성별'].astype('category')
컬럼단위_명목df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 철수 to 석영
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학년      9 non-null      category
 1   성별      9 non-null      category
 2   국어      9 non-null      int64
 3   영어      9 non-null      int64
 4   수학      9 non-null      int64
 5   과학      9 non-null      int64
dtypes: category(2), int64(4)
memory usage: 1006.0+ bytes

In [17]:
# 3. 범주형 데이터를 '명목척도'로 변환
    # 방법 2) 데이터프레임 전체에 적용 후 복사본 리턴 받기:
범주형_명목df = origin.astype(
    {
        '학년':'category',
        '성별':'category'
    }
)
범주형_명목df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 철수 to 석영
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학년      9 non-null      category
 1   성별      9 non-null      category
 2   국어      9 non-null      int64
 3   영어      9 non-null      int64
 4   수학      9 non-null      int64
 5   과학      9 non-null      int64
dtypes: category(2), int64(4)
memory usage: 1006.0+ bytes

In [21]:
# 4. 범주형 데이터를 '서열척도'로 변환
    # 방법 1) 컬럼 단위로 적용하여 원본에 직접 적용하기:
컬럼단위_서열척도df = origin.copy()
컬럼단위_서열척도df['학년'] = 컬럼단위_서열척도df['학년'].astype(
    CategoricalDtype(categories=[1, 2, 3, 4], ordered=True)
    )    # 범주형 값의 종류를 담은 리스트  # 서열척도임을 표시 (기본값: False/명목척도)
컬럼단위_서열척도df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 철수 to 석영
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학년      9 non-null      category
 1   성별      9 non-null      object
 2   국어      9 non-null      int64
 3   영어      9 non-null      int64
 4   수학      9 non-null      int64
 5   과학      9 non-null      int64
dtypes: category(1), int64(4), object(1)
memory usage: 945.0+ bytes

In [22]:
# 4. 범주형 데이터를 '서열척도'로 변환
    # 방법 2) 데이터프레임 전체에 적용 후 복사본 리턴 받기:
서열척도df = origin.astype(
    {
        '학년': CategoricalDtype(categories = [1, 2, 3, 4], ordered=True)
    }
)
서열척도df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 철수 to 석영
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학년      9 non-null      category
 1   성별      9 non-null      object
 2   국어      9 non-null      int64
 3   영어      9 non-null      int64
 4   수학      9 non-null      int64
 5   과학      9 non-null      int64
dtypes: category(1), int64(4), object(1)
memory usage: 945.0+ bytes

### #04. 행,열 이름 변경

In [23]:
#-----------------<강사님 설명>---------------------
# key : value => key가 기존 이름, value가 변경할 이름
#--------------------------------------------------

# 1. rename() 메서드 사용하기:
이름변경df = origin.rename(
    columns={
        '국어':'kor', '영어':'eng', '수학':'math', '과학':'sci'
    },
    index={
        '석영':'Suk', '호영':'Ho', '민철':'Min', '수현':'Su'
    } 
)
이름변경df

     학년  성별  kor  eng  math  sci
이름
철수    1  남자   98   77    88   64
영희    2  여자   88  120    62   72
Min   1  남자   92   70    83   79
Su    3  여자   63   60    31   71
Ho    4  남자   75   50    90   88
영호    4  남자   80   88    91   72
용식    2  남자   82   88    79   90
나영    1  여자   90   92    81   95
Suk   1  남자   91   90    89   80